{
    "Algeria": "Algeria, officially the People's Democratic Republic of Algeria, is a country in the Maghreb region of North Africa. It is bordered to the northeast by Tunisia; to the east by Libya; to the southeast by Niger; to the southwest by Mali, Mauritania, and Western Sahara; to the west by Morocco; and to the north by the Mediterranean Sea. The capital and largest city is Algiers, located in the far north on the Mediterranean coast.",
    "Angola": "Angola, officially the Republic of Angola, is a country on the west-central coast of Southern Africa. It is the second-largest Portuguese-speaking (Lusophone) country in both total area and population and is the seventh-largest country in Africa. It is bordered by Namibia to the south, the Democratic Republic of the Congo to the north, Zambia to the east, and the Atlantic Ocean to the west. Angola has an exclave province, the province of Cabinda, that borders the Republic of the Congo and the Democratic Republic of the Congo. The capital and most populous city is Luanda.",
    "Benin": "Benin, officially the Republic of Benin, is a country in West Africa. It was formerly known as Dahomey. It is bordered by Togo to the west, Nigeria to the east, Burkina Faso to the north-west, and Niger to the north-east. The majority of its population lives on the southern coastline of the Bight of Benin, part of the Gulf of Guinea in the northernmost tropical portion of the Atlantic Ocean. The capital is Porto-Novo, and the seat of government is in Cotonou, the most populous city and economic capital. Benin covers an area of 112,622 km2 (43,484 sq mi), and its population in 2021 was estimated to be approximately 13 million. It is a tropical country with an economy heavily dependent on agriculture and is an exporter of palm oil and cotton.",
    "Botswana": "Botswana, officially the Republic of Botswana, is a landlocked country in Southern Africa. Botswana is topographically flat, with approximately 70 percent of its territory part of the Kalahari Desert. It is bordered by South Africa to the south and southeast, Namibia to the west and north, Zambia to the north, and Zimbabwe to the northeast. With a population of slightly over 2.4 million people and a comparable land area to France, Botswana is one of the most sparsely populated countries in the world. It is essentially the nation-state of the Tswana people, who constitute nearly 80 percent of the population.",
    "Burkina Faso": "Burkina Faso is a landlocked country in West Africa, bordered by Mali to the northwest, Niger to the northeast, Benin to the southeast, Togo and Ghana to the south, and Ivory Coast to the southwest. It covers an area of 274,223 km2. In 2024, the country had an estimated population of approximately 23,286,000. Previously called the Republic of Upper Volta (1958–1984), it was renamed Burkina Faso by former president Thomas Sankara. Its citizens are known as Burkinabè, and its capital and largest city is Ouagadougou.",
    "Burundi": "Burundi, officially the Republic of Burundi, is a landlocked country in East Africa. It is located in the Great Rift Valley at the junction between the African Great Lakes region and Southeast Africa, with a population of over 14 million people. It is bordered by Rwanda to the north, Tanzania to the east and southeast, and the Democratic Republic of the Congo to the west; Lake Tanganyika lies along its southwestern border. The capital city is Gitega and the largest city is Bujumbura.",
    "Cabo Verde": "Cape Verde or Cabo Verde, officially the Republic of Cabo Verde, is an island country and archipelagic state of West Africa in the central Atlantic Ocean, consisting of ten volcanic islands with a combined land area of about 4,033 square kilometres (1,557 sq mi). These islands lie between 600 and 850 kilometres west of Cap-Vert, the westernmost point of continental Africa. The Cape Verde islands form part of the Macaronesia ecoregion, along with the Azores, the Canary Islands, Madeira and the Savage Isles.",
    "Cameroon": "Cameroon, officially the Republic of Cameroon, is a country in Central Africa. It shares boundaries with Nigeria to the west and north, Chad to the northeast, the Central African Republic to the east, and Equatorial Guinea, Gabon, and the Republic of the Congo to the south. Its coastline lies on the Bight of Biafra, part of the Gulf of Guinea, and the Atlantic Ocean. Due to its strategic position at the crossroads between West Africa and Central Africa, it has been categorized as being in both camps. Cameroon's population of nearly 31 million people speak 250 native languages, in addition to the national tongues of English and French, or both. Early inhabitants of the territory included the Sao civilisation around Lake Chad and the Baka hunter-gatherers in the southeastern rainforest. Portuguese explorers reached the coast in the 15th century and named the area Rio dos Camarões, which became Cameroon in English. Fulani soldiers founded the Adamawa Emirate in the north in the 19th century, and various ethnic groups of the west and northwest established powerful chiefdoms and fondoms.",
    "Central African Republic": "The Central African Republic (CAR) is a landlocked country in Central Africa. It is bordered by Chad to the north, Sudan to the northeast, South Sudan to the east, the Democratic Republic of the Congo to the south, the Republic of the Congo to the southwest, and Cameroon to the west. Bangui is the country's capital and largest city, bordering the Democratic Republic of the Congo. The Central African Republic covers a land area of about 620,000 square kilometres (240,000 sq mi). As of 2024, it has a population of 5,357,744, consisting of about 80 ethnic groups, and is in the scene of a civil war, which has been ongoing since 2012. Having been a French colony under the name Ubangi-Shari, French is the official language, with Sango, a Ngbandi-based creole language, as the national and co-official language.",
    "Chad": "Chad, officially the Republic of Chad, is a landlocked country at the crossroads of North and Central Africa. It is bordered by Libya to the north, Sudan to the east, the Central African Republic to the south, Cameroon to the southwest, Nigeria to the southwest, and Niger to the west. Chad has a population of 16 million, of which 1.6 million live in the capital and largest city of N'Djamena. With a total area of around 1,300,000 km2 (500,000 sq mi), Chad is the fifth-largest country in Africa and the twentiethhlargest nation by area.",
    "Comoros": "The Comoros, officially the Union of the Comoros, is an archipelagic country made up of three islands in Southeastern Africa, located at the northern end of the Mozambique Channel in the Indian Ocean. Its capital and largest city is Moroni. The religion of the majority of the population, and the official state religion, is Sunni Islam. Comoros proclaimed its independence from France on 6 July 1975. The Comoros is the only country of the Arab League which is entirely in the Southern Hemisphere. It is a member state of the African Union, the Organisation internationale de la Francophonie, the Organisation of Islamic Co-operation, and the Indian Ocean Commission. The country has three official languages: Shikomori, French and Arabic.",
    "Congo, Republic of the": "The Republic of the Congo, also known as Congo-Brazzaville, the Congo Republic or simply the Congo, is a country located on the western coast of Central Africa to the west of the Congo River. It is bordered to the west by Gabon, to the northwest by Cameroon, to the northeast by the Central African Republic, to the southeast by the Democratic Republic of the Congo, to the south by the Angolan exclave of Cabinda, and to the southwest by the Atlantic Ocean.",
    "Congo, Democratic Republic of the": "The Democratic Republic of the Congo (DRC), also known as the DR Congo, Congo-Kinshasa, or simply the Congo, is a country in Central Africa. By land area, it is the second-largest country in Africa and the 11th-largest in the world. With a population of around 115 million, the DR Congo is the most populous nominally Francophone country in the world. French is the official and most widely spoken language, though there are over 200 indigenous languages. The national capital and largest city is Kinshasa, which is also the economic center. The country is bordered by the Republic of the Congo, the Cabinda exclave of Angola, and the South Atlantic Ocean to the west; the Central African Republic and South Sudan to the north; Uganda, Rwanda, Burundi, and Tanzania to the east; and Zambia and Angola to the south. Centered on the Congo Basin, most of the country's terrain is covered by dense rainforests and crossed by many rivers, while the east and southeast are mountainous.",
    "Djibouti": "Djibouti, officially the Republic of Djibouti, is a country in the Horn of Africa, bordered by Somalia to the south, Ethiopia to the southwest, Eritrea in the north, and the Red Sea and the Gulf of Aden to the east. The country has an area of 23,200 km2 (8,958 sq mi).",
    "Egypt": "Egypt, officially the Arab Republic of Egypt, is a country spanning the northeast corner of Africa and southwest corner of Asia via the Sinai Peninsula. It is bordered by the Mediterranean Sea to the north, the Gaza Strip of Palestine and Israel to the northeast, the Red Sea to the east, Sudan to the south, and Libya to the west; the Gulf of Aqaba in the northeast separates Egypt from Jordan and Saudi Arabia. Cairo is the capital, largest city, and leading cultural center, while Alexandria is the second-largest city and an important hub of industry and tourism. At approximately 107 million inhabitants, Egypt is the third-most populous country in Africa and 14th-most populated in the world.",
    "Equatorial Guinea": "Equatorial Guinea, officially the Republic of Equatorial Guinea, is a country on the west coast of Central Africa. It has an area of 28,000 square kilometres (11,000 sq mi). Formerly the colony of Spanish Guinea, its post-independence name refers to its location near both the Equator and in the African region of Guinea. As of 2024, the country had a population of 1,795,834, over 85% of whom are members of the Fang people, the country's dominant ethnic group. The Bubi people, indigenous to Bioko, are the second largest group at approximately 6.5% of the population.",
    "Eritrea": "Eritrea, officially the State of Eritrea, is a country in the Horn of Africa region of East Africa, with its capital and largest city being Asmara. It is bordered by Ethiopia in the south, Sudan in the west, and Djibouti in the southeast. The northeastern and eastern parts of Eritrea have an extensive coastline along the Red Sea. The nation has a total area of approximately 117,600 km2 (45,406 sq mi), and includes the Dahlak Archipelago and several of the Hanish Islands.",
    "Eswatini": "Eswatini, formally the Kingdom of Eswatini, also known by its former official names Swaziland and the Kingdom of Swaziland, is a landlocked country in Southern Africa. It is bordered by Mozambique to its northeast and South Africa to its north, west, south, and southeast. At no more than 200 km (120 mi) north to south and 130 km (81 mi) east to west, Eswatini is one of the smallest countries in Africa; despite this, its climate and topography are diverse, ranging from a cool and mountainous highveld to a hot and dry lowveld.",
    "Ethiopia": "Ethiopia, officially the Federal Democratic Republic of Ethiopia, is a landlocked country located in the Horn of Africa region of East Africa. It shares borders with Eritrea to the north, Djibouti to the northeast, Somalia to the east, Kenya to the south, South Sudan to the west, and Sudan to the northwest. Ethiopia covers a land area of 1,104,300 square kilometres (426,400 sq mi). As of 2024, it is home to around 132 million inhabitants, making it the 10th-most populous country in the world, the 2nd-most populous in Africa after Nigeria, and the most populated landlocked country on Earth. The national capital and largest city, Addis Ababa, lies several kilometres west of the East African Rift that splits the country into the African and Somali tectonic plates.",
    "Gabon": "Gabon, officially the Gabonese Republic, is a country on the Atlantic coast of Central Africa, on the equator, bordered by Equatorial Guinea to the northwest, Cameroon to the north, the Republic of the Congo to the east and south, and the Gulf of Guinea to the west. It has an area of 270,000 square kilometres (100,000 sq mi) and a population of 2.3 million people. There are coastal plains, mountains, and a savanna in the east. Libreville is the country's capital and largest city.",
    "Gambia": "The Gambia, officially the Republic of The Gambia, is a country in West Africa. Geographically, The Gambia is the smallest country in continental Africa; it is surrounded by Senegal on all sides except for the western part, which is bordered by the Atlantic Ocean.",
    "Ghana": "Ghana, officially the Republic of Ghana, is a country in West Africa. It lies adjacent to the Gulf of Guinea and the Atlantic Ocean to the south, sharing a border with Ivory Coast in the west, Burkina Faso in the north, and Togo in the east. Ghana covers an area of 239,567 km2 (92,497 sq mi), spanning diverse ecologies, from coastal savannas to tropical rainforests. With nearly 35 million inhabitants, Ghana is the second-most populous country in West Africa. The capital and largest city is Accra; other significant cities include Tema, Kumasi, Sunyani, Wa, Cape Coast, Techiman, Tamale, and Sekondi-Takoradi. In 1957 Ghana became the first colony in Sub-Saharan Africa to achieve sovereignty, under the leadership of Kwame Nkrumah.",
    "Guinea": "Guinea, officially the Republic of Guinea, is a coastal country in West Africa. It borders the Atlantic Ocean to the west, Guinea-Bissau to the northwest, Senegal to the north, Mali to the northeast, Côte d'Ivoire to the southeast, and Sierra Leone and Liberia to the south. It is sometimes referred to as Guinea-Conakry, after its capital Conakry, to distinguish it from other territories in the eponymous region, such as Guinea-Bissau and Equatorial Guinea. Guinea has a population of 14 million and an area of 245,857 square kilometres (94,926 sq mi).",
    "Guinea-Bissau": "Guinea-Bissau, officially the Republic of Guinea-Bissau, is a country in West Africa that covers 36,125 square kilometres (13,948 sq mi) with an estimated population of 2,026,778. It borders Senegal to its north and Guinea to its southeast.",
    "Ivory Coast": "Ivory Coast, also known as Côte d'Ivoire and officially the Republic of Côte d'Ivoire, is a country on the southern coast of West Africa. Its capital city of Yamoussoukro is located in the centre of the country, while its largest city and economic centre is the port city of Abidjan. It borders Guinea to the northwest, Liberia to the west, Mali to the northwest, Burkina Faso to the northeast, Ghana to the east, and the Atlantic Ocean's Gulf of Guinea to the south. With 31.5 million inhabitants in 2024, Ivory Coast is the third-most populous country in West Africa. Its official language is French, and indigenous languages are also widely used, including Bété, Baoulé, Dyula, Dan, Anyin, and Cebaara Senufo. In total, there are around 78 languages spoken in Ivory Coast. The country has a religiously diverse population, including numerous followers of Islam, Christianity, and traditional faiths often entailing animism.",
    "Kenya": "Kenya, officially the Republic of Kenya, is a country in East Africa. With an estimated population of more than 52.4 million as of mid-2024, Kenya is the 27th-most-populous country in the world and 7th most populous in Africa. Kenya's capital and largest city is Nairobi, while its oldest and second-largest city, is the major port city of Mombasa, situated on Mombasa Island in the Indian Ocean and the surrounding mainland. Mombasa was the capital of the British East Africa Protectorate, which included most of what is now Kenya and southwestern Somalia, from 1889 to 1907. Other important cities include Kisumu and Nakuru. Kenya is bordered by South Sudan to the northwest, Ethiopia to the north, Somalia to the east, Uganda to the west, Tanzania to the south, and the Indian Ocean to the southeast.",
    "Lesotho": "Lesotho, formally the Kingdom of Lesotho, formerly known as Basutoland, is a landlocked country in Southern Africa. As an enclave of South Africa, with which it shares a 1,106 km (687 mi) border, it is the largest sovereign enclave in the world, and the only one outside the Italian Peninsula. It is situated in the Maloti Mountains and contains the highest peak in Southern Africa. It has an area of over 30,000 km2 (11,600 sq mi) and has a population of about two million. Its capital and largest city is Maseru. The country is also known by the nickname The Mountain Kingdom/The Kingdom in the Sky.",
    "Liberia": "Liberia, officially the Republic of Liberia, is a country on the West African coast. It is bordered by Sierra Leone to its northwest, Guinea to its north, Ivory Coast to its east, and the Atlantic Ocean to its south and southwest. It has a population of around 5.5 million and covers an area of 43,000 square miles (111,369 km2). The official language is English. Over 20 indigenous languages are spoken, reflecting the country's ethnic and cultural diversity. The capital and largest city is Monrovia.",
    "Libya": "Libya, officially the State of Libya, is a country in the Maghreb region of North Africa. It borders the Mediterranean Sea to the north, Egypt to the east, Sudan to the southeast, Chad to the south, Niger to the southwest, Algeria to the west, and Tunisia to the northwest, as well as maritime borders with Greece, Italy and Malta to the north. Libya comprises three historical regions: Tripolitania, Fezzan, and Cyrenaica. With an area of almost 1.8 million km2 (700,000 sq mi), it is the fourth-largest country in Africa and the Arab world, and the 16th-largest in the world. Libya claims 32,000 square kilometres of southeastern Algeria, south of the Libyan town of Ghat. The country's official religion is Islam, with 96.6% of the Libyan population being Sunni Muslims. The official language of Libya is Arabic, with vernacular Libyan Arabic being spoken most widely. The majority of Libya's population is Arab. The largest city and capital, Tripoli, is located in northwestern Libya and contains over a million of Libya's seven million people.",
    "Madagascar": "Madagascar, officially the Republic of Madagascar, is an island country that includes the island of Madagascar and numerous smaller peripheral islands. Lying off the southeastern coast of Africa, it is the world's fourth largest island, the second-largest island country, and the 46th largest country overall. Its capital and largest city is Antananarivo.",
    "Malawi": "Malawi, officially the Republic of Malawi and formerly known as Nyasaland, is a landlocked country in Southeastern Africa. It is bordered by Zambia to the west, Tanzania to the north and northeast, and Mozambique to the east, south, and southwest. Malawi spans over 118,484 km2 (45,747 sq mi) and has an estimated population of 21,240,689. Malawi's capital and largest city is Lilongwe. Its second largest is Blantyre, its third largest is Mzuzu, and its fourth largest is Zomba, the former capital.",
    "Mali": "Mali, officially the Republic of Mali, is a landlocked country in West Africa. It is the eighth-largest country in Africa, with an area of over 1,240,192 square kilometres (478,841 sq mi). The country is bordered to the north by Algeria, to the east by Niger, to the northwest by Mauritania, to the south by Burkina Faso and Ivory Coast, and to the west by Guinea and Senegal. The population of Mali is about 23.29 million 47.19% of which are estimated to be under the age of 15 in 2024. Its capital and largest city is Bamako. The country has 13 official languages, of which Bambara is the most commonly spoken.",
    "Mauritania": "Mauritania, formally the Islamic Republic of Mauritania, is a sovereign country in Northwest Africa. It is bordered by the Atlantic Ocean to the west, Western Sahara to the north and northwest, Algeria to the northeast, Mali to the east and southeast, and Senegal to the southwest. By land area Mauritania is the 11th-largest country in Africa and 28th-largest in the world; 90% of its territory is in the Sahara. Most of its population of some 4.3 million lives in the temperate south of the country, with roughly a third concentrated in the capital and largest city, Nouakchott, on the Atlantic coast.",
    "Mauritius": "Mauritius, officially the Republic of Mauritius, is an island country in the Indian Ocean, about 2,000 kilometres off the southeastern coast of East Africa, east of Madagascar. It includes the main island, as well as Rodrigues, Agaléga, and St. Brandon. The islands of Mauritius and Rodrigues, along with nearby Réunion, are part of the Mascarene Islands. The main island of Mauritius, where the population is concentrated, hosts the capital and largest city, Port Louis. The country spans 2,040 square kilometres (790 sq mi).",
    "Morocco": "Morocco, officially the Kingdom of Morocco, is a country in the Maghreb region of North Africa. It overlooks the Mediterranean Sea to the north and the Atlantic Ocean to the west, and has land borders with Algeria to the east, and the disputed territory of Western Sahara to the south. Morocco also claims the Spanish exclaves of Ceuta, Melilla and Peñón de Vélez de la Gomera, and several small Spanish-controlled islands off its coast. It has a population of approximately 37 million. Islam is both the official and predominant religion, while Arabic and Berber are the official languages. Additionally, French and the Moroccan dialect of Arabic are widely spoken. The culture of Morocco is a mix of Arab, Berber, African and European cultures. Its capital is Rabat, while its largest city is Casablanca.",
    "Mozambique": "Mozambique, officially the Republic of Mozambique, is a country located in Southeast Africa bordered by the Indian Ocean to the east, Tanzania to the north, Malawi and Zambia to the northwest, Zimbabwe to the west, and Eswatini and South Africa to the south and southwest. The sovereign state is separated from the Comoros, Mayotte, and Madagascar by the Mozambique Channel to the east. The capital and largest city is Maputo.",
    "Namibia": "Namibia, officially the Republic of Namibia, is a country on the west coast of Southern Africa. Its borders include the Atlantic Ocean to the west, Angola and Zambia to the north, Botswana to the east and South Africa to the south; in the northeast, approximating a quadripoint, Zimbabwe lies less than 200 metres away along the Zambezi River near Kazungula, Zambia. Namibia's capital and largest city is Windhoek.",
    "Niger": "Niger, officially the Republic of the Niger, is a landlocked country in West Africa. It is a unitary state bordered by Libya to the northeast, Chad to the east, Nigeria to the south, Benin and Burkina Faso to the southwest, Mali to the west, and Algeria to the northwest. It covers a land area of almost 1,270,000 km2 (490,000 sq mi), making it the largest landlocked country in West Africa and the second largest landlocked nation in Africa behind Chad. Over 80% of its land area lies in the Sahara. Its predominantly Muslim population of about 25 million lives mostly in clusters in the south and west of the country. The capital Niamey is located in Niger's southwest corner along the namesake Niger River.",
    "Nigeria": "Nigeria, officially the Federal Republic of Nigeria, is a country in West Africa. It is situated between the Sahel to the north and the Gulf of Guinea in the Atlantic Ocean to the south. It covers an area of 923,769 square kilometres (356,669 sq mi). With a population of more than 230 million, it is the most populous country in Africa, and the world's sixth-most populous country. Nigeria borders Niger in the north, Chad in the northeast, Cameroon in the east, and Benin in the west. Nigeria is a federal republic comprising 36 states and the Federal Capital Territory, where its capital, Abuja, is located. The largest city in Nigeria by population is Lagos, one of the largest metropolitan areas in the world and the largest in Africa.",
    "Rwanda": "Rwanda, officially the Republic of Rwanda, is a landlocked country in the Great Rift Valley of East Africa, where the African Great Lakes region and Southeast Africa converge. Located a few degrees south of the Equator, Rwanda is bordered by Uganda, Tanzania, Burundi, and the Democratic Republic of the Congo. With a comparatively high elevation, Rwanda has been given the sobriquet \"land of a thousand hills\", with its geography dominated by mountains in the west and savanna to the southeast, with numerous lakes throughout the country. The climate is temperate to subtropical, with two rainy seasons and two dry seasons each year. It is the most densely populated mainland African country; among countries larger than 10,000 km2, it is the third-most densely populated country in the world. Its capital and largest city is Kigali.",
    "Sao Tome and Principe": "São Tomé and Príncipe, officially the Democratic Republic of São Tomé and Príncipe, is an island country in the Gulf of Guinea, off the western equatorial coast of Central Africa. It consists of two archipelagos around the two main islands of São Tomé and Príncipe, about 150 km (93.21 mi) apart and about 250 and 225 km off the northwestern coast of Gabon. With a population of 201,800, São Tomé and Príncipe is the second-smallest and second-least populous African sovereign state after Seychelles.",
    "Senegal": "Senegal, officially the Republic of Senegal, is the westernmost country in West Africa, situated on the Atlantic Ocean coastline. It borders Mauritania to the north, Mali to the east, Guinea to the southeast and Guinea-Bissau to the southwest. Senegal nearly surrounds The Gambia, a country occupying a narrow sliver of land along the banks of the Gambia River, which separates Senegal's southern region of Casamance from the rest of the country. It also shares a maritime border with Cape Verde. Senegal's economic and political capital is Dakar.",
    "Seychelles": "Seychelles, officially the Republic of Seychelles, is an island country and archipelagic state consisting of 155 islands in the Indian Ocean. Its capital and largest city, Victoria, is 1,500 kilometres east of mainland Africa. Nearby island countries and territories include the Comoros, Madagascar, Mauritius, and the French overseas departments of Mayotte and Réunion to the south; and the Chagos Archipelago to the east.\nSeychelles is the smallest country in Africa as well as the least populated sovereign African country, with an estimated population of 100,600 in 2022.",
    "Sierra Leone": "Sierra Leone, officially the Republic of Sierra Leone, is a country on the southwest coast of West Africa. It is bordered to the southeast by Liberia and by Guinea to the north. Sierra Leone's land area is 73,252 km2 (28,283 sq mi). It has a tropical climate and environments ranging from savannas to rainforests. As of the 2023 census, Sierra Leone has a population of 8,908,040. Freetown is both its capital and its largest city. The country is divided into five administrative regions, which are further subdivided into 16 districts.",
    "Somalia": "Somalia, officially the Federal Republic of Somalia, is the easternmost country in continental Africa. The country is located in the Horn of Africa and is bordered by Ethiopia to the west, Djibouti to the northwest, Kenya to the southwest, the Gulf of Aden to the north, and the Indian Ocean to the east. Somalia has the longest coastline on Africa's mainland. Somalia has an estimated population of 18.1 million, of which 2.7 million live in the capital and largest city, Mogadishu. Around 85% of Somalia's residents are ethnic Somalis; the official languages of the country are Somali and Arabic, though Somali is the primary language. Somalia has historic and religious ties to the Arab world. As such the people in Somalia are Muslims, the majority of them Sunni.",
    "South Africa": "South Africa, officially the Republic of South Africa (RSA), is the southernmost country in Africa. Its nine provinces are bounded to the south by 2,798 kilometres of coastline that stretches along the South Atlantic and Indian Ocean; to the north by the neighbouring countries of Namibia, Botswana, and Zimbabwe; to the east and northeast by Mozambique and Eswatini; and it encloses Lesotho. Covering an area of 1,221,037 square kilometres, the country has over 62 million people. Pretoria is the administrative capital, while Cape Town, as the seat of Parliament, is the legislative capital, and Bloemfontein is regarded as the judicial capital. The largest, most populous city is Johannesburg, followed by Cape Town and Durban.",
    "South Sudan": "South Sudan, officially the Republic of South Sudan, is a landlocked country in East Africa. It is bordered on the north by Sudan; on the east by Ethiopia; on the south by the Democratic Republic of the Congo, Uganda and Kenya; and on the west by the Central African Republic. South Sudan's diverse landscape includes vast plains and plateaus, dry and tropical savannahs, inland floodplains, and forested mountains. The Nile River system is the defining physical feature of the country, running south to north across its center, which is dominated by a large swamp known as the Sudd. South Sudan has a population of 12.7 million. Juba is the capital and largest city.",
    "Sudan": "Sudan, officially the Republic of the Sudan, is a country in Northeast Africa. It borders the Central African Republic to the southwest, Chad to the west, Libya to the northwest, Egypt to the north, the Red Sea to the east, Eritrea and Ethiopia to the southeast, and South Sudan to the south. Sudan has a population of 50 million people as of 2024 and occupies 1,886,068 square kilometres, making it Africa's third-largest country by area and the third-largest by area in the Arab League. It was the largest country by area in Africa and the Arab League until the secession of South Sudan in 2011; since then both titles have been held by Algeria. Sudan's capital and most populous city is Khartoum.",
    "Tanzania": "Tanzania, officially the United Republic of Tanzania, is a country in East Africa within the African Great Lakes region. It is bordered by Uganda to the northwest; Kenya to the northeast; the Indian Ocean to the east; Mozambique and Malawi to the south; Zambia to the southwest; and Rwanda, Burundi, and the Democratic Republic of the Congo to the west. According to the 2022 national census, Tanzania has a population of around 62 million, making it the most populous country located entirely south of the equator.",
    "Togo": "Togo, officially the Togolese Republic, is a country in West Africa. It is bordered by Ghana to the west, Benin to the east and Burkina Faso to the north. It is one of the least developed countries and extends south to the Gulf of Guinea, where its capital, Lomé, is located. It is a small, tropical country, spanning 57,000 square kilometres with a population of approximately 8 million, and it has a width of less than 115 km (71 mi) between Ghana and its eastern neighbour Benin.",
    "Tunisia": "Tunisia, officially the Republic of Tunisia, is a country in the Maghreb region of North Africa. It is bordered by Algeria to the west and southwest, Libya to the southeast, and the Mediterranean Sea to the north and east. Tunisia also shares maritime borders with Italy through the islands of Sicily and Sardinia to the north and Malta to the east. It features the archaeological sites of Carthage dating back to the 9th century BC, as well as the Great Mosque of Kairouan. Known for its ancient architecture, souks, and blue coasts, it covers 163,610 km2 (63,170 sq mi), and has a population of 12.1 million. It contains the eastern end of the Atlas Mountains and the northern reaches of the Sahara desert; much of its remaining territory is arable land. Its 1,300 km (810 mi) of coastline includes the African conjunction of the western and eastern parts of the Mediterranean Basin. Tunisia is home to Africa's northernmost point, Cape Angela. Located on the northeastern coast, Tunis is the capital and largest city of the country, which is itself named after Tunis. The official language of Tunisia is Modern Standard Arabic. The vast majority of Tunisia's population is Arab and Muslim. Vernacular Tunisian Arabic is the most spoken, and French also serves as an administrative and educational language in some contexts, but it has no official status.",
    "Uganda": "Uganda, officially the Republic of Uganda, is a landlocked country in East Africa. It is bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by Rwanda, and to the south by Tanzania. The southern part includes a substantial portion of Lake Victoria, shared with Kenya and Tanzania. Uganda is in the African Great Lakes region, lies within the Nile basin, and has a varied equatorial climate. As of 2024, it has a population of nearly 46 million, of which 8.5 million live in the capital and largest city, Kampala.",
    "Zambia": "Zambia, officially the Republic of Zambia, is a landlocked country at the crossroads of Central, Southern and East Africa. It is typically referred to being in South-Central Africa or Southern Africa. It is bordered to the north by the Democratic Republic of the Congo, Tanzania to the north-east, Malawi to the east, Mozambique to the southeast, Zimbabwe and Botswana to the south, Namibia to the southwest, and Angola to the west. The capital city of Zambia is Lusaka, located in the south-central part of Zambia. The population is concentrated mainly around Lusaka in the south and the Copperbelt Province to the north, the core economic hubs of the country.",
    "Zimbabwe": "Zimbabwe, officially the Republic of Zimbabwe, is a landlocked country in Southeast Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa to the south, Botswana to the southwest, Zambia to the north, and Mozambique to the east. The capital and largest city is Harare, and the second largest is Bulawayo."
}